# Задача 3. Непрерывная случайная величина X распределена нормально и задана плотностью
# распределения
# f(x) = (1 / (4 * sqrt(2pi))) * exp((-(x+2)**2) / 32)
# Найдите:
# а). M(X)
# б). D(X)
# в). std(X) (среднее квадратичное отклонение)

# распределение Гаусса f(x) = (1 / (std(X) * sqrt(2pi))) * exp((-(x-M(X))**2) / 2*D(X))
print(f'a) M(X)=-2, б) D(X)=16, в)std(X)=4')